
ODC_DB = {
	["光棍号-安娜丝塔丽"] = {
		["inventory"] = {
			{
				"1@|cff0070dd|Hitem:9534::::::::46:::11::::|h[工程学协会头盔]|h|r", -- [1]
				"1@|cff0070dd|Hitem:7722::::::::46:::1::::|h[圣使护符]|h|r", -- [2]
				"1@|cff1eff00|Hitem:15617::::::863:2009278336:46:::::::|h[雄鹰之骨链肩铠]|h|r", -- [3]
				"1@|cffffffff|Hitem:6117::::::::46:::::::|h[侍从衬衣]|h|r", -- [4]
				"1@|cff1eff00|Hitem:9924::::::875:1194749056:46:::1::::|h[雄鹰之追踪者外套]|h|r", -- [5]
				"1@|cff1eff00|Hitem:10329::::::::46:::1::::|h[血色十字军腰带]|h|r", -- [6]
				"1@|cff1eff00|Hitem:15616::::::873:1669530880:46:::1::::|h[雄鹰之骨链腿铠]|h|r", -- [7]
				"1@|cff1eff00|Hitem:9895:852:::::1031:1178683520:46:::1::::|h[巨鲸之狂战士之靴]|h|r", -- [8]
				"1@|cff0070dd|Hitem:9409::::::177:1825270528:46:::1::::|h[智力之艾隆纳亚的护腕]|h|r", -- [9]
				"1@|cff0070dd|Hitem:18083::::::::46:::1::::|h[苏玛赞护手]|h|r", -- [10]
				"1@|cff0070dd|Hitem:11118::::::178:292523776:46:::1::::|h[智力之阿扎达斯之石]|h|r", -- [11]
				"1@|cff1eff00|Hitem:11987::::::770:1301995648:46:::1::::|h[夜枭之铱金戒指]|h|r", -- [12]
				"1@|cff1eff00|Hitem:7474:884:::::854:220967296:46:::1::::|h[雄鹰之华丽披风]|h|r", -- [13]
				"1@|cff0070dd|Hitem:6953::::::::46:::11::::|h[维里甘之拳]|h|r", -- [14]
			}, -- [1]
		},
		["bag"] = {
			{
				"1@|cff9d9d9d|Hitem:2154::::::::46:::::::|h[摩根·拉迪莫尔的故事]|h|r", -- [1]
				"1@|cffffffff|Hitem:6948::::::::46:::::::|h[炉石]|h|r", -- [2]
				"1@|cffffffff|Hitem:8484::::::::46:::11::::|h[加基森水业公司护理袋]|h|r", -- [3]
				"5@|cffffffff|Hitem:8483::::::::46:::::::|h[废土水袋]|h|r", -- [4]
				"1@|cffffffff|Hitem:10682::::::::46:::::::|h[奔尼斯特拉兹的誓言石]|h|r", -- [5]
				"1@|cffffffff|Hitem:3248::::::::46:::::::|h[翻译好的藏尸者信件]|h|r", -- [6]
				"1@|cffffffff|Hitem:5797::::::::46:::::::|h[精铁碎片]|h|r", -- [7]
				"1@|cffffffff|Hitem:5852::::::::46:::::::|h[燃料调节器的蓝图]|h|r", -- [8]
				"1@|cffffffff|Hitem:8584::::::::46:::11::::|h[未使用的寻水器]|h|r", -- [9]
				"1@|cffffffff|Hitem:7667::::::::46:::11::::|h[塔瓦斯德的占卜之瓶]|h|r", -- [10]
				"1@|cffffffff|Hitem:3898::::::::46:::::::|h[图书馆手稿]|h|r", -- [11]
				"1@|cffffffff|Hitem:10699::::::::46:::11::::|h[叶基亚的树枝]|h|r", -- [12]
				"1@|cffffffff|Hitem:9507::::::::46:::::::|h[仔细包装过的箱子]|h|r", -- [13]
				"1@|cffffffff|Hitem:6996::::::::46:::::::|h[乔丹的武器材料单]|h|r", -- [14]
				"9@|cffffffff|Hitem:9308::::::::46:::::::|h[脏兮兮的东西]|h|r", -- [15]
				"1@|cffffffff|Hitem:9279::::::::46:::::::|h[白色穿孔卡片]|h|r", -- [16]
				"9@|cffffffff|Hitem:2799::::::::46:::::::|h[猩猩牙]|h|r", -- [17]
				"1@|cffffffff|Hitem:9326::::::::46:::::::|h[脏兮兮的戒指]|h|r", -- [18]
				"2@|cffffffff|Hitem:4363::::::::46:::::::|h[铜质调节器]|h|r", -- [19]
				"17@|cffffffff|Hitem:2862::::::::46:::::::|h[劣质磨刀石]|h|r", -- [20]
				"3@|cffffffff|Hitem:3241::::::::46:::::::|h[重平衡石]|h|r", -- [21]
				"15@|cffffffff|Hitem:3859::::::::46:::::::|h[钢锭]|h|r", -- [22]
				"1@|cffffffff|Hitem:4338::::::::46:::::::|h[魔纹布]|h|r", -- [23]
				"1@|cffffffff|Hitem:5956::::::::46:::14::::|h[铁匠之锤]|h|r", -- [24]
				"1@|cffffffff|Hitem:2901::::::::46:::14::::|h[矿工锄]|h|r", -- [25]
				"1@|cffffffff|Hitem:6365::::::::46:::14::::|h[强化钓鱼竿]|h|r", -- [26]
				"20@|cffffffff|Hitem:6451::::::::46:::::::|h[厚丝质绷带]|h|r", -- [27]
				"20@|cffffffff|Hitem:6451::::::::46:::::::|h[厚丝质绷带]|h|r", -- [28]
				"20@|cffffffff|Hitem:8545::::::::46:::::::|h[厚魔纹绷带]|h|r", -- [29]
				"19@|cffffffff|Hitem:8545::::::::46:::::::|h[厚魔纹绷带]|h|r", -- [30]
				"5@|cffffffff|Hitem:2454::::::::46:::::::|h[狮王之力药剂]|h|r", -- [31]
				"1@|cffffffff|Hitem:2454::::::::46:::::::|h[狮王之力药剂]|h|r", -- [32]
				"5@|cffffffff|Hitem:2458::::::::46:::::::|h[初级坚韧药剂]|h|r", -- [33]
				"20@|cffffffff|Hitem:5525::::::::46:::::::|h[水煮蚌肉]|h|r", -- [34]
				"17@|cffffffff|Hitem:5525::::::::46:::::::|h[水煮蚌肉]|h|r", -- [35]
				"12@|cffffffff|Hitem:6530::::::::46:::::::|h[夜色虫]|h|r", -- [36]
				"10@|cffffffff|Hitem:4791::::::::46:::::::|h[魔法水]|h|r", -- [37]
				"5@|cffffffff|Hitem:6149::::::::46:::::::|h[强效法力药水]|h|r", -- [38]
				"1@|cffffffff|Hitem:6149::::::::46:::::::|h[强效法力药水]|h|r", -- [39]
				"5@|cffffffff|Hitem:3928::::::::46:::::::|h[超强治疗药水]|h|r", -- [40]
				"1@|cffffffff|Hitem:3928::::::::46:::::::|h[超强治疗药水]|h|r", -- [41]
				"4@|cffffffff|Hitem:20516::::::::46:::::::|h[光滑的苹果]|h|r", -- [42]
				"1@|cff1eff00|Hitem:7146::::::::46:::1::::|h[血色十字军钥匙]|h|r", -- [43]
				"4@|cff1eff00|Hitem:15869::::::::46:::::::|h[白银万能钥匙]|h|r", -- [44]
				"1@|cff1eff00|Hitem:6757::::::::46:::11::::|h[吉安娜的徽记之戒]|h|r", -- [45]
				"1@|cff1eff00|Hitem:4071:908:::::::46:::::::|h[微光锁甲护胸]|h|r", -- [46]
				"1@|cff1eff00|Hitem:9531::::::::46:::11::::|h[晶岩肩铠]|h|r", -- [47]
				"1@|cff1eff00|Hitem:15270::::::875:1532413568:46:::1::::|h[雄鹰之巨人战斧]|h|r", -- [48]
				"1@|cff1eff00|Hitem:10772::::::::46:::1::::|h[暴食者之斧]|h|r", -- [49]
				"1@|cff0070dd|Hitem:7726::::::::46:::1::::|h[血色指挥官之盾]|h|r", -- [50]
				"1@|cff0070dd|Hitem:2933::::::::46:::11::::|h[乌瑞恩的图章]|h|r", -- [51]
				"1@|cff0070dd|Hitem:9640:856:::::1124:1057438848:46:::1::::|h[野猪之虎钳夹口]|h|r", -- [52]
				"1@|cff0070dd|Hitem:10330:18:::::::46:::1::::|h[血色十字军护腿]|h|r", -- [53]
				"1@|cff0070dd|Hitem:9641::::::::46:::1::::|h[活力护符]|h|r", -- [54]
				"1@|cff0070dd|Hitem:10763::::::::46:::1::::|h[冰铁之盔]|h|r", -- [55]
				"1@|cff0070dd|Hitem:6909::::::::46:::1::::|h[海蛇之击]|h|r", -- [56]
				"1@|cff0070dd|Hitem:6830::::::::46:::11::::|h[咬骨之斧]|h|r", -- [57]
				"1@|cff0070dd|Hitem:10823::::::::46:::11::::|h[征服者之剑]|h|r", -- [58]
			}, -- [1]
		},
		["whisperlog"] = {
		},
		["tradelog"] = {
		},
		["bank"] = {
		},
	},
}
ODC_Config = {
	["Options"] = {
		["whisperlog"] = {
			["maxmsg"] = 500,
		},
		["tradelog"] = {
			["maxmsg"] = 50,
			["autowhisper"] = "whisper",
		},
	},
	["UI"] = {
	},
	["DBver"] = 50,
	["icon"] = {
		["minimapPos"] = 195,
		["radius"] = 80,
		["hide"] = false,
	},
	["toggle"] = {
		["inventory"] = true,
		["bag"] = true,
		["whisperlog"] = true,
		["tradelog"] = true,
		["bank"] = true,
	},
}
MB_DB = nil
BB_DB = nil
IN_DB = nil
MB_Config = nil
